Tekla.Structures.Model.ReferenceModel.#ctor
Creates a new reference model instance.
The default values are as follows:
Filename = "";
ProjectGUID = new Guid();
ModelGUID = new Guid();
VersionGUID = new Guid();
Position = new Point();
Scale = 1.0;
Visibility = VisibilityEnum.VISIBLE;

Tekla.Structures.Model.ReferenceModel.#ctor(System.String,Tekla.Structures.Geometry3d.Point,System.Double)
Creates a new reference model instance using the given filename, position and scale.
Filename: The filename to be used.
Position: The position to be used.
Scale: The scale to be used.

Tekla.Structures.Model.ReferenceModel.Filename
The filename of the reference model.